
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанныеПоID(Команда)
	
	ТекстОшибки = "";
	
	ДанныеПользователя = ВыполнениеЗапросовAPI.ПолучитьДанныеСервисаПоIDПользователя(IDПользователя, ТекстОшибки);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		
		Сообщение 		= новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить данные пользователя на сервисе Rest-api. " + Символы.ПС + ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ДанныеПользователя,IDПользователя", ДанныеПользователя,IDПользователя);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыводаИнформации", ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор());
	
КонецПроцедуры

#КонецОбласти


